espressif/arduino-esp32/boards.txt
t-beam.menu.UploadSpeed.921600=921600
t-beam.menu.UploadSpeed.921600.upload.speed=921600
t-beam.menu.UploadSpeed.115200=115200
t-beam.menu.UploadSpeed.115200.upload.speed=115200
t-beam.menu.UploadSpeed.256000.windows=256000
t-beam.menu.UploadSpeed.256000.upload.speed=256000
t-beam.menu.UploadSpeed.230400.windows.upload.speed=256000
t-beam.menu.UploadSpeed.230400=230400
t-beam.menu.UploadSpeed.230400.upload.speed=230400
t-beam.menu.UploadSpeed.460800.linux=460800
t-beam.menu.UploadSpeed.460800.macosx=460800
t-beam.menu.UploadSpeed.460800.upload.speed=460800
t-beam.menu.UploadSpeed.512000.windows=512000
t-beam.menu.UploadSpeed.512000.upload.speed=512000

t-beam.menu.DebugLevel.none=None
t-beam.menu.DebugLevel.none.build.code_debug=0
t-beam.menu.DebugLevel.error=Error
t-beam.menu.DebugLevel.error.build.code_debug=1
t-beam.menu.DebugLevel.warn=Warn
t-beam.menu.DebugLevel.warn.build.code_debug=2
t-beam.menu.DebugLevel.info=Info
t-beam.menu.DebugLevel.info.build.code_debug=3
t-beam.menu.DebugLevel.debug=Debug
t-beam.menu.DebugLevel.debug.build.code_debug=4
t-beam.menu.DebugLevel.verbose=Verbose
t-beam.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

d-duino-32.name=D-duino-32

d-duino-32.upload.tool=esptool_py
d-duino-32.upload.maximum_size=1310720
d-duino-32.upload.maximum_data_size=327680
d-duino-32.upload.flags=
d-duino-32.upload.extra_flags=

d-duino-32.serial.disableDTR=true
d-duino-32.serial.disableRTS=true

d-duino-32.build.tarch=xtensa
d-duino-32.build.bootloader_addr=0x1000
d-duino-32.build.target=esp32
d-duino-32.build.mcu=esp32
d-duino-32.build.core=esp32
d-duino-32.build.variant=d-duino-32
d-duino-32.build.board=D_Duino_32

d-duino-32.build.f_cpu=240000000L
d-duino-32.build.flash_size=4MB
d-duino-32.build.flash_freq=40m
d-duino-32.build.flash_mode=dio
d-duino-32.build.boot=dio
d-duino-32.build.partitions=default
d-duino-32.build.defines=

d-duino-32.menu.PartitionScheme.default=Default
d-duino-32.menu.PartitionScheme.default.build.partitions=default
d-duino-32.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
d-duino-32.menu.PartitionScheme.minimal.build.partitions=minimal
d-duino-32.menu.PartitionScheme.no_ota=No OTA (Large APP)
d-duino-32.menu.PartitionScheme.no_ota.build.partitions=no_ota
d-duino-32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
d-duino-32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
d-duino-32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
d-duino-32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
d-duino-32.menu.PartitionScheme.fatflash=16M Fat
d-duino-32.menu.PartitionScheme.fatflash.build.partitions=ffat

d-duino-32.menu.FlashFreq.80=80MHz
d-duino-32.menu.FlashFreq.80.build.flash_freq=80m
d-duino-32.menu.FlashFreq.40=40MHz
d-duino-32.menu.FlashFreq.40.build.flash_freq=40m

d-duino-32.menu.UploadSpeed.921600=921600
d-duino-32.menu.UploadSpeed.921600.upload.speed=921600
d-duino-32.menu.UploadSpeed.115200=115200
d-duino-32.menu.UploadSpeed.115200.upload.speed=115200
d-duino-32.menu.UploadSpeed.256000.windows=256000
d-duino-32.menu.UploadSpeed.256000.upload.speed=256000
d-duino-32.menu.UploadSpeed.230400.windows.upload.speed=256000
d-duino-32.menu.UploadSpeed.230400=230400
d-duino-32.menu.UploadSpeed.230400.upload.speed=230400
d-duino-32.menu.UploadSpeed.460800.linux=460800
d-duino-32.menu.UploadSpeed.460800.macosx=460800
d-duino-32.menu.UploadSpeed.460800.upload.speed=460800
d-duino-32.menu.UploadSpeed.512000.windows=512000
d-duino-32.menu.UploadSpeed.512000.upload.speed=512000

d-duino-32.menu.DebugLevel.none=None
d-duino-32.menu.DebugLevel.none.build.code_debug=0
d-duino-32.menu.DebugLevel.error=Error
d-duino-32.menu.DebugLevel.error.build.code_debug=1
d-duino-32.menu.DebugLevel.warn=Warn
d-duino-32.menu.DebugLevel.warn.build.code_debug=2
d-duino-32.menu.DebugLevel.info=Info
d-duino-32.menu.DebugLevel.info.build.code_debug=3
d-duino-32.menu.DebugLevel.debug=Debug
d-duino-32.menu.DebugLevel.debug.build.code_debug=4
d-duino-32.menu.DebugLevel.verbose=Verbose
d-duino-32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

lopy.name=LoPy

lopy.upload.tool=esptool_py
lopy.upload.maximum_size=1310720
lopy.upload.maximum_data_size=327680
lopy.upload.flags=
lopy.upload.extra_flags=

lopy.serial.disableDTR=true
lopy.serial.disableRTS=true

lopy.build.tarch=xtensa
lopy.build.bootloader_addr=0x1000
lopy.build.target=esp32
lopy.build.mcu=esp32
lopy.build.core=esp32
lopy.build.variant=lopy
lopy.build.board=LoPy

lopy.build.f_cpu=240000000L
lopy.build.flash_mode=dio
lopy.build.flash_size=4MB
lopy.build.boot=dio
lopy.build.partitions=default

lopy.menu.FlashFreq.80=80MHz
lopy.menu.FlashFreq.80.build.flash_freq=80m
lopy.menu.FlashFreq.40=40MHz
lopy.menu.FlashFreq.40.build.flash_freq=40m

lopy.menu.UploadSpeed.921600=921600
lopy.menu.UploadSpeed.921600.upload.speed=921600
lopy.menu.UploadSpeed.115200=115200
lopy.menu.UploadSpeed.115200.upload.speed=115200
lopy.menu.UploadSpeed.256000.windows=256000
lopy.menu.UploadSpeed.256000.upload.speed=256000
lopy.menu.UploadSpeed.230400.windows.upload.speed=256000
lopy.menu.UploadSpeed.230400=230400
lopy.menu.UploadSpeed.230400.upload.speed=230400
lopy.menu.UploadSpeed.460800.linux=460800
lopy.menu.UploadSpeed.460800.macosx=460800
lopy.menu.UploadSpeed.460800.upload.speed=460800
lopy.menu.UploadSpeed.512000.windows=512000
lopy.menu.UploadSpeed.512000.upload.speed=512000

lopy.menu.DebugLevel.none=None
lopy.menu.DebugLevel.none.build.code_debug=0
lopy.menu.DebugLevel.error=Error
lopy.menu.DebugLevel.error.build.code_debug=1
lopy.menu.DebugLevel.warn=Warn
lopy.menu.DebugLevel.warn.build.code_debug=2
lopy.menu.DebugLevel.info=Info
lopy.menu.DebugLevel.info.build.code_debug=3
lopy.menu.DebugLevel.debug=Debug
lopy.menu.DebugLevel.debug.build.code_debug=4
lopy.menu.DebugLevel.verbose=Verbose
lopy.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

lopy4.name=LoPy4

lopy4.upload.tool=esptool_py
lopy4.upload.maximum_size=1310720
lopy4.upload.maximum_data_size=327680
lopy4.upload.flags=
lopy4.upload.extra_flags=

lopy4.serial.disableDTR=true
lopy4.serial.disableRTS=true

lopy4.build.tarch=xtensa
lopy4.build.bootloader_addr=0x1000
lopy4.build.target=esp32
lopy4.build.mcu=esp32
lopy4.build.core=esp32
lopy4.build.variant=lopy4
lopy4.build.board=LoPy4

lopy4.build.f_cpu=240000000L
lopy4.build.flash_mode=dio
lopy4.build.flash_size=4MB
lopy4.build.boot=dio
lopy4.build.partitions=default

lopy4.menu.PSRAM.disabled=Disabled
lopy4.menu.PSRAM.disabled.build.defines=
lopy4.menu.PSRAM.disabled.build.extra_libs=
lopy4.menu.PSRAM.enabled=Enabled
lopy4.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
lopy4.menu.PSRAM.enabled.build.extra_libs=

