espressif/arduino-esp32/boards.txt
##############################################################


ET-Board.name=ET-Board

ET-Board.upload.tool=esptool_py
ET-Board.upload.maximum_size=1310720
ET-Board.upload.maximum_data_size=327680
ET-Board.upload.wait_for_upload_port=true
ET-Board.upload.flags=
ET-Board.upload.extra_flags=

ET-Board.serial.disableDTR=true
ET-Board.serial.disableRTS=true

ET-Board.build.tarch=xtensa
ET-Board.build.bootloader_addr=0x1000
ET-Board.build.target=esp32
ET-Board.build.mcu=esp32
ET-Board.build.core=esp32
ET-Board.build.variant=ET-Board
ET-Board.build.board=ET-Board
ET-Board.build.f_cpu=240000000L
ET-Board.build.flash_mode=dio
ET-Board.build.flash_size=4MB
ET-Board.build.boot=dio
ET-Board.build.partitions=default
ET-Board.build.defines=

ET-Board.menu.PartitionScheme.default=Default
ET-Board.menu.PartitionScheme.default.build.partitions=default
ET-Board.menu.PartitionScheme.no_ota=No OTA (Large APP)
ET-Board.menu.PartitionScheme.no_ota.build.partitions=no_ota
ET-Board.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ET-Board.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
ET-Board.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ET-Board.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

ET-Board.menu.FlashFreq.80=80MHz
ET-Board.menu.FlashFreq.80.build.flash_freq=80m
ET-Board.menu.FlashFreq.40=40MHz
ET-Board.menu.FlashFreq.40.build.flash_freq=40m

ET-Board.menu.UploadSpeed.921600=921600
ET-Board.menu.UploadSpeed.921600.upload.speed=921600
ET-Board.menu.UploadSpeed.115200=115200
ET-Board.menu.UploadSpeed.115200.upload.speed=115200
ET-Board.menu.UploadSpeed.256000.windows=256000
ET-Board.menu.UploadSpeed.256000.upload.speed=256000
ET-Board.menu.UploadSpeed.230400.windows.upload.speed=256000
ET-Board.menu.UploadSpeed.230400=230400
ET-Board.menu.UploadSpeed.230400.upload.speed=230400
ET-Board.menu.UploadSpeed.460800.linux=460800
ET-Board.menu.UploadSpeed.460800.macosx=460800
ET-Board.menu.UploadSpeed.460800.upload.speed=460800
ET-Board.menu.UploadSpeed.512000.windows=512000
ET-Board.menu.UploadSpeed.512000.upload.speed=512000

ET-Board.menu.DebugLevel.none=None
ET-Board.menu.DebugLevel.none.build.code_debug=0
ET-Board.menu.DebugLevel.error=Error
ET-Board.menu.DebugLevel.error.build.code_debug=1
ET-Board.menu.DebugLevel.warn=Warn
ET-Board.menu.DebugLevel.warn.build.code_debug=2
ET-Board.menu.DebugLevel.info=Info
ET-Board.menu.DebugLevel.info.build.code_debug=3
ET-Board.menu.DebugLevel.debug=Debug
ET-Board.menu.DebugLevel.debug.build.code_debug=4
ET-Board.menu.DebugLevel.verbose=Verbose
ET-Board.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

ch_denky.name=Denky

ch_denky.upload.tool=esptool_py
ch_denky.upload.maximum_size=1310720
ch_denky.upload.maximum_data_size=327680
ch_denky.upload.flags=
ch_denky.upload.extra_flags=

ch_denky.serial.disableDTR=true
ch_denky.serial.disableRTS=true

ch_denky.build.tarch=xtensa
ch_denky.build.bootloader_addr=0x1000
ch_denky.build.target=esp32
ch_denky.build.mcu=esp32
ch_denky.build.core=esp32
ch_denky.build.variant=ch_denky
ch_denky.build.board=DENKY

ch_denky.build.f_cpu=240000000L
ch_denky.build.flash_size=4MB
ch_denky.build.flash_freq=80m
ch_denky.build.flash_mode=dio
ch_denky.build.boot=dio
ch_denky.build.partitions=default
ch_denky.build.defines=

ch_denky.menu.Revision.denkyd4=PICO-V3-02
ch_denky.menu.Revision.denkyd4.build.board=DENKY_PICOV3
ch_denky.menu.Revision.denkyd4.build.flash_size=8MB
ch_denky.menu.Revision.denky32=WROOM32
ch_denky.menu.Revision.denky32.build.board=DENKY_WROOM32
ch_denky.menu.Revision.denkyd4.build.flash_size=4MB

ch_denky.menu.PartitionScheme.default=Default
ch_denky.menu.PartitionScheme.default.build.partitions=default
ch_denky.menu.PartitionScheme.no_ota=No OTA (Large APP)
ch_denky.menu.PartitionScheme.no_ota.build.partitions=no_ota
ch_denky.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ch_denky.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
ch_denky.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ch_denky.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

ch_denky.menu.UploadSpeed.921600=921600
ch_denky.menu.UploadSpeed.921600.upload.speed=921600
ch_denky.menu.UploadSpeed.115200=115200
ch_denky.menu.UploadSpeed.115200.upload.speed=115200
ch_denky.menu.UploadSpeed.256000.windows=256000
ch_denky.menu.UploadSpeed.256000.upload.speed=256000
ch_denky.menu.UploadSpeed.230400.windows.upload.speed=256000
ch_denky.menu.UploadSpeed.230400=230400
ch_denky.menu.UploadSpeed.230400.upload.speed=230400
ch_denky.menu.UploadSpeed.460800.linux=460800
ch_denky.menu.UploadSpeed.460800.macosx=460800
ch_denky.menu.UploadSpeed.460800.upload.speed=460800
ch_denky.menu.UploadSpeed.512000.windows=512000
ch_denky.menu.UploadSpeed.512000.upload.speed=512000

ch_denky.menu.PSRAM.enabled=Enabled
ch_denky.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
ch_denky.menu.PSRAM.enabled.build.extra_libs=
ch_denky.menu.PSRAM.disabled=Disabled
ch_denky.menu.PSRAM.disabled.build.defines=
ch_denky.menu.PSRAM.disabled.build.extra_libs=

ch_denky.menu.DebugLevel.none=None
ch_denky.menu.DebugLevel.none.build.code_debug=0
ch_denky.menu.DebugLevel.error=Error
ch_denky.menu.DebugLevel.error.build.code_debug=1
ch_denky.menu.DebugLevel.warn=Warn
ch_denky.menu.DebugLevel.warn.build.code_debug=2
ch_denky.menu.DebugLevel.info=Info
ch_denky.menu.DebugLevel.info.build.code_debug=3
ch_denky.menu.DebugLevel.debug=Debug
ch_denky.menu.DebugLevel.debug.build.code_debug=4
ch_denky.menu.DebugLevel.verbose=Verbose
ch_denky.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

uPesy_wrover.name=uPesy ESP32 Wrover DevKit

uPesy_wrover.upload.tool=esptool_py
uPesy_wrover.upload.maximum_size=1310720
uPesy_wrover.upload.maximum_data_size=327680
uPesy_wrover.upload.flags=
uPesy_wrover.upload.extra_flags=

uPesy_wrover.serial.disableDTR=true
uPesy_wrover.serial.disableRTS=true

uPesy_wrover.build.tarch=xtensa
uPesy_wrover.build.bootloader_addr=0x1000
uPesy_wrover.build.target=esp32
uPesy_wrover.build.mcu=esp32
uPesy_wrover.build.core=esp32
uPesy_wrover.build.variant=uPesy_esp32_wrover_devkit
uPesy_wrover.build.board=uPesy_WROVER

uPesy_wrover.build.f_cpu=240000000L
uPesy_wrover.build.flash_size=4MB
uPesy_wrover.build.flash_freq=80m
uPesy_wrover.build.flash_mode=dio
uPesy_wrover.build.boot=dio
uPesy_wrover.build.partitions=default
uPesy_wrover.build.defines=

uPesy_wrover.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.default.build.partitions=default
uPesy_wrover.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
uPesy_wrover.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
uPesy_wrover.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
uPesy_wrover.menu.PartitionScheme.minimal.build.partitions=minimal
uPesy_wrover.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.no_ota.build.partitions=no_ota
uPesy_wrover.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
uPesy_wrover.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
uPesy_wrover.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
uPesy_wrover.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
uPesy_wrover.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
uPesy_wrover.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
uPesy_wrover.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
uPesy_wrover.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
uPesy_wrover.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
uPesy_wrover.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
uPesy_wrover.menu.PartitionScheme.huge_app.build.partitions=huge_app
uPesy_wrover.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
uPesy_wrover.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
uPesy_wrover.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
uPesy_wrover.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

uPesy_wrover.menu.CPUFreq.240=240MHz
uPesy_wrover.menu.CPUFreq.240.build.f_cpu=240000000L
uPesy_wrover.menu.CPUFreq.160=160MHz
uPesy_wrover.menu.CPUFreq.160.build.f_cpu=160000000L

uPesy_wrover.menu.UploadSpeed.921600=921600
uPesy_wrover.menu.UploadSpeed.921600.upload.speed=921600
uPesy_wrover.menu.UploadSpeed.512000.windows=512000
uPesy_wrover.menu.UploadSpeed.512000.upload.speed=512000
uPesy_wrover.menu.UploadSpeed.460800.linux=460800
uPesy_wrover.menu.UploadSpeed.460800.macosx=460800
uPesy_wrover.menu.UploadSpeed.460800.upload.speed=460800
uPesy_wrover.menu.UploadSpeed.256000.windows=256000
uPesy_wrover.menu.UploadSpeed.256000.upload.speed=256000
uPesy_wrover.menu.UploadSpeed.230400.windows.upload.speed=256000
uPesy_wrover.menu.UploadSpeed.230400=230400
uPesy_wrover.menu.UploadSpeed.230400.upload.speed=230400
uPesy_wrover.menu.UploadSpeed.115200=115200
uPesy_wrover.menu.UploadSpeed.115200.upload.speed=115200

uPesy_wrover.menu.FlashMode.qio=QIO
uPesy_wrover.menu.FlashMode.qio.build.flash_mode=dio
uPesy_wrover.menu.FlashMode.qio.build.boot=qio
uPesy_wrover.menu.FlashMode.dio=DIO
uPesy_wrover.menu.FlashMode.dio.build.flash_mode=dio
uPesy_wrover.menu.FlashMode.dio.build.boot=dio

uPesy_wrover.menu.FlashFreq.80=80MHz
uPesy_wrover.menu.FlashFreq.80.build.flash_freq=80m
uPesy_wrover.menu.FlashFreq.40=40MHz
uPesy_wrover.menu.FlashFreq.40.build.flash_freq=40m

uPesy_wrover.menu.PSRAM.enabled=Enabled
uPesy_wrover.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
uPesy_wrover.menu.PSRAM.enabled.build.extra_libs=
uPesy_wrover.menu.PSRAM.disabled=Disabled
uPesy_wrover.menu.PSRAM.disabled.build.defines=
uPesy_wrover.menu.PSRAM.disabled.build.extra_libs=

uPesy_wrover.menu.DebugLevel.none=None
uPesy_wrover.menu.DebugLevel.none.build.code_debug=0
uPesy_wrover.menu.DebugLevel.error=Error
uPesy_wrover.menu.DebugLevel.error.build.code_debug=1
uPesy_wrover.menu.DebugLevel.warn=Warn
uPesy_wrover.menu.DebugLevel.warn.build.code_debug=2
uPesy_wrover.menu.DebugLevel.info=Info
uPesy_wrover.menu.DebugLevel.info.build.code_debug=3
uPesy_wrover.menu.DebugLevel.debug=Debug
uPesy_wrover.menu.DebugLevel.debug.build.code_debug=4
uPesy_wrover.menu.DebugLevel.verbose=Verbose
uPesy_wrover.menu.DebugLevel.verbose.build.code_debug=5

