espressif/arduino-esp32/boards.txt
esp32-trueverit-iot-driver.build.tarch=xtensa
esp32-trueverit-iot-driver.build.bootloader_addr=0x1000
esp32-trueverit-iot-driver.build.target=esp32
esp32-trueverit-iot-driver.build.mcu=esp32
esp32-trueverit-iot-driver.build.core=esp32
esp32-trueverit-iot-driver.build.variant=esp32-trueverit-iot-driver
esp32-trueverit-iot-driver.build.board=Trueverit_ESP32_Universal_IoT_Driver

esp32-trueverit-iot-driver.build.f_cpu=240000000L
esp32-trueverit-iot-driver.build.flash_mode=dio
esp32-trueverit-iot-driver.build.flash_size=4MB
esp32-trueverit-iot-driver.build.boot=dio
esp32-trueverit-iot-driver.build.partitions=default
esp32-trueverit-iot-driver.build.defines=

esp32-trueverit-iot-driver.menu.FlashFreq.80=80MHz
esp32-trueverit-iot-driver.menu.FlashFreq.80.build.flash_freq=80m
esp32-trueverit-iot-driver.menu.FlashFreq.40=40MHz
esp32-trueverit-iot-driver.menu.FlashFreq.40.build.flash_freq=40m

esp32-trueverit-iot-driver.menu.UploadSpeed.115200=115200
esp32-trueverit-iot-driver.menu.UploadSpeed.115200.upload.speed=115200
esp32-trueverit-iot-driver.menu.UploadSpeed.256000.windows=256000
esp32-trueverit-iot-driver.menu.UploadSpeed.256000.upload.speed=256000
esp32-trueverit-iot-driver.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-trueverit-iot-driver.menu.UploadSpeed.230400=230400
esp32-trueverit-iot-driver.menu.UploadSpeed.230400.upload.speed=230400
esp32-trueverit-iot-driver.menu.UploadSpeed.460800.linux=460800
esp32-trueverit-iot-driver.menu.UploadSpeed.460800.macosx=460800
esp32-trueverit-iot-driver.menu.UploadSpeed.460800.upload.speed=460800

esp32-trueverit-iot-driver.menu.DebugLevel.none=None
esp32-trueverit-iot-driver.menu.DebugLevel.none.build.code_debug=0
esp32-trueverit-iot-driver.menu.DebugLevel.error=Error
esp32-trueverit-iot-driver.menu.DebugLevel.error.build.code_debug=1
esp32-trueverit-iot-driver.menu.DebugLevel.warn=Warn
esp32-trueverit-iot-driver.menu.DebugLevel.warn.build.code_debug=2
esp32-trueverit-iot-driver.menu.DebugLevel.info=Info
esp32-trueverit-iot-driver.menu.DebugLevel.info.build.code_debug=3
esp32-trueverit-iot-driver.menu.DebugLevel.debug=Debug
esp32-trueverit-iot-driver.menu.DebugLevel.debug.build.code_debug=4
esp32-trueverit-iot-driver.menu.DebugLevel.verbose=Verbose
esp32-trueverit-iot-driver.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

esp32-trueverit-iot-driver-mkii.name=Trueverit ESP32 Universal IoT Driver MK II

esp32-trueverit-iot-driver-mkii.upload.tool=esptool_py
esp32-trueverit-iot-driver-mkii.upload.maximum_size=1310720
esp32-trueverit-iot-driver-mkii.upload.maximum_data_size=327680
esp32-trueverit-iot-driver-mkii.upload.flags=
esp32-trueverit-iot-driver-mkii.upload.extra_flags=

esp32-trueverit-iot-driver-mkii.serial.disableDTR=true
esp32-trueverit-iot-driver-mkii.serial.disableRTS=true

esp32-trueverit-iot-driver-mkii.build.tarch=xtensa
esp32-trueverit-iot-driver-mkii.build.bootloader_addr=0x1000
esp32-trueverit-iot-driver-mkii.build.target=esp32
esp32-trueverit-iot-driver-mkii.build.mcu=esp32
esp32-trueverit-iot-driver-mkii.build.core=esp32
esp32-trueverit-iot-driver-mkii.build.variant=esp32-trueverit-iot-driver-mkii
esp32-trueverit-iot-driver-mkii.build.board=Trueverit_ESP32_Universal_IoT_Driver_MK_II

esp32-trueverit-iot-driver-mkii.build.f_cpu=240000000L
esp32-trueverit-iot-driver-mkii.build.flash_mode=dio
esp32-trueverit-iot-driver-mkii.build.flash_size=4MB
esp32-trueverit-iot-driver-mkii.build.boot=dio
esp32-trueverit-iot-driver-mkii.build.partitions=default
esp32-trueverit-iot-driver-mkii.build.defines=

esp32-trueverit-iot-driver-mkii.menu.FlashFreq.80=80MHz
esp32-trueverit-iot-driver-mkii.menu.FlashFreq.80.build.flash_freq=80m
esp32-trueverit-iot-driver-mkii.menu.FlashFreq.40=40MHz
esp32-trueverit-iot-driver-mkii.menu.FlashFreq.40.build.flash_freq=40m

esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.115200=115200
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.115200.upload.speed=115200
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.256000.windows=256000
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.256000.upload.speed=256000
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.230400=230400
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.230400.upload.speed=230400
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.460800.linux=460800
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.460800.macosx=460800
esp32-trueverit-iot-driver-mkii.menu.UploadSpeed.460800.upload.speed=460800

esp32-trueverit-iot-driver-mkii.menu.DebugLevel.none=None
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.none.build.code_debug=0
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.error=Error
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.error.build.code_debug=1
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.warn=Warn
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.warn.build.code_debug=2
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.info=Info
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.info.build.code_debug=3
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.debug=Debug
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.debug.build.code_debug=4
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.verbose=Verbose
esp32-trueverit-iot-driver-mkii.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

atmegazero_esp32s2.name=ATMegaZero ESP32-S2
atmegazero_esp32s2.vid.0=0x239A
atmegazero_esp32s2.pid.0=0x800A

atmegazero_esp32s2.upload.tool=esptool_py
atmegazero_esp32s2.upload.maximum_size=1310720
atmegazero_esp32s2.upload.maximum_data_size=327680
atmegazero_esp32s2.upload.flags=
atmegazero_esp32s2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
atmegazero_esp32s2.upload.use_1200bps_touch=true
atmegazero_esp32s2.upload.wait_for_upload_port=true

atmegazero_esp32s2.serial.disableDTR=false
atmegazero_esp32s2.serial.disableRTS=false

atmegazero_esp32s2.build.tarch=xtensa
atmegazero_esp32s2.build.bootloader_addr=0x1000
atmegazero_esp32s2.build.target=esp32s2
atmegazero_esp32s2.build.mcu=esp32s2
atmegazero_esp32s2.build.core=esp32
atmegazero_esp32s2.build.variant=atmegazero_esp32s2
atmegazero_esp32s2.build.board=atmegazero_esp32s2

atmegazero_esp32s2.build.serial=0
atmegazero_esp32s2.build.f_cpu=240000000L
atmegazero_esp32s2.build.flash_size=4MB
atmegazero_esp32s2.build.flash_freq=80m
atmegazero_esp32s2.build.flash_mode=qio
atmegazero_esp32s2.build.boot=qio
atmegazero_esp32s2.build.partitions=default
atmegazero_esp32s2.build.defines=

atmegazero_esp32s2.menu.SerialMode.cdc=USB CDC
atmegazero_esp32s2.menu.SerialMode.cdc.build.serial=1
atmegazero_esp32s2.menu.SerialMode.default=UART0
atmegazero_esp32s2.menu.SerialMode.default.build.serial=0

atmegazero_esp32s2.menu.PSRAM.disabled=Disabled
atmegazero_esp32s2.menu.PSRAM.disabled.build.defines=
atmegazero_esp32s2.menu.PSRAM.enabled=Enabled
atmegazero_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

atmegazero_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.default.build.partitions=default
atmegazero_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
atmegazero_esp32s2.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
atmegazero_esp32s2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
atmegazero_esp32s2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
atmegazero_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
atmegazero_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
atmegazero_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
atmegazero_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
atmegazero_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
atmegazero_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
atmegazero_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
atmegazero_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
atmegazero_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
atmegazero_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
atmegazero_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
atmegazero_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
atmegazero_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
atmegazero_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
atmegazero_esp32s2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
atmegazero_esp32s2.menu.PartitionScheme.fatflash.build.partitions=ffat
atmegazero_esp32s2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
atmegazero_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
atmegazero_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
atmegazero_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

atmegazero_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
atmegazero_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
atmegazero_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
atmegazero_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
atmegazero_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
atmegazero_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
atmegazero_esp32s2.menu.CPUFreq.40=40MHz
atmegazero_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
atmegazero_esp32s2.menu.CPUFreq.20=20MHz
atmegazero_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
atmegazero_esp32s2.menu.CPUFreq.10=10MHz
atmegazero_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

atmegazero_esp32s2.menu.FlashMode.qio=QIO
atmegazero_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
atmegazero_esp32s2.menu.FlashMode.qio.build.boot=qio
atmegazero_esp32s2.menu.FlashMode.dio=DIO
atmegazero_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
atmegazero_esp32s2.menu.FlashMode.dio.build.boot=dio
atmegazero_esp32s2.menu.FlashMode.qout=QOUT
atmegazero_esp32s2.menu.FlashMode.qout.build.flash_mode=dout
atmegazero_esp32s2.menu.FlashMode.qout.build.boot=qout
atmegazero_esp32s2.menu.FlashMode.dout=DOUT
atmegazero_esp32s2.menu.FlashMode.dout.build.flash_mode=dout
atmegazero_esp32s2.menu.FlashMode.dout.build.boot=dout

