espressif/arduino-esp32/boards.txt
atmegazero_esp32s2.menu.FlashFreq.80=80MHz
atmegazero_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
atmegazero_esp32s2.menu.FlashFreq.40=40MHz
atmegazero_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

atmegazero_esp32s2.menu.FlashSize.4M=4MB (32Mb)
atmegazero_esp32s2.menu.FlashSize.4M.build.flash_size=4MB
atmegazero_esp32s2.menu.FlashSize.8M=8MB (64Mb)
atmegazero_esp32s2.menu.FlashSize.8M.build.flash_size=8MB
atmegazero_esp32s2.menu.FlashSize.8M.build.partitions=default_8MB
atmegazero_esp32s2.menu.FlashSize.2M=2MB (16Mb)
atmegazero_esp32s2.menu.FlashSize.2M.build.flash_size=2MB
atmegazero_esp32s2.menu.FlashSize.2M.build.partitions=minimal
atmegazero_esp32s2.menu.FlashSize.16M=16MB (128Mb)
atmegazero_esp32s2.menu.FlashSize.16M.build.flash_size=16MB

atmegazero_esp32s2.menu.UploadSpeed.921600=921600
atmegazero_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
atmegazero_esp32s2.menu.UploadSpeed.115200=115200
atmegazero_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
atmegazero_esp32s2.menu.UploadSpeed.256000.windows=256000
atmegazero_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
atmegazero_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
atmegazero_esp32s2.menu.UploadSpeed.230400=230400
atmegazero_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
atmegazero_esp32s2.menu.UploadSpeed.460800.linux=460800
atmegazero_esp32s2.menu.UploadSpeed.460800.macosx=460800
atmegazero_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
atmegazero_esp32s2.menu.UploadSpeed.512000.windows=512000
atmegazero_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

atmegazero_esp32s2.menu.DebugLevel.none=None
atmegazero_esp32s2.menu.DebugLevel.none.build.code_debug=0
atmegazero_esp32s2.menu.DebugLevel.error=Error
atmegazero_esp32s2.menu.DebugLevel.error.build.code_debug=1
atmegazero_esp32s2.menu.DebugLevel.warn=Warn
atmegazero_esp32s2.menu.DebugLevel.warn.build.code_debug=2
atmegazero_esp32s2.menu.DebugLevel.info=Info
atmegazero_esp32s2.menu.DebugLevel.info.build.code_debug=3
atmegazero_esp32s2.menu.DebugLevel.debug=Debug
atmegazero_esp32s2.menu.DebugLevel.debug.build.code_debug=4
atmegazero_esp32s2.menu.DebugLevel.verbose=Verbose
atmegazero_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

deneyapmini.name=Deneyap Mini

deneyapmini.vid.0=0x303a
deneyapmini.pid.0=0x0002

deneyapmini.upload.tool=esptool_py
deneyapmini.upload.maximum_size=1310720
deneyapmini.upload.maximum_data_size=327680
deneyapmini.upload.flags=
deneyapmini.upload.extra_flags=
deneyapmini.upload.use_1200bps_touch=false
deneyapmini.upload.wait_for_upload_port=false

deneyapmini.serial.disableDTR=false
deneyapmini.serial.disableRTS=false

deneyapmini.build.tarch=xtensa
deneyapmini.build.bootloader_addr=0x1000
deneyapmini.build.target=esp32s2
deneyapmini.build.mcu=esp32s2
deneyapmini.build.core=esp32
deneyapmini.build.variant=deneyapmini
deneyapmini.build.board=DYM

deneyapmini.build.serial=0
deneyapmini.build.f_cpu=240000000L
deneyapmini.build.flash_size=4MB
deneyapmini.build.flash_freq=80m
deneyapmini.build.flash_mode=qio
deneyapmini.build.boot=qio
deneyapmini.build.partitions=default
deneyapmini.build.defines=

deneyapmini.menu.SerialMode.default=USB_CDC
deneyapmini.menu.SerialMode.default.build.serial=1
deneyapmini.menu.SerialMode.uart=UART0
deneyapmini.menu.SerialMode.uart.build.serial=0

deneyapmini.menu.PSRAM.disabled=Disabled
deneyapmini.menu.PSRAM.disabled.build.defines=
deneyapmini.menu.PSRAM.enabled=Enabled
deneyapmini.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

deneyapmini.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapmini.menu.PartitionScheme.default.build.partitions=default
deneyapmini.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapmini.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapmini.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
deneyapmini.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapmini.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapmini.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapmini.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapmini.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapmini.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapmini.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapmini.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapmini.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapmini.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapmini.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapmini.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapmini.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapmini.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapmini.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapmini.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapmini.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapmini.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapmini.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapmini.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapmini.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapmini.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapmini.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
deneyapmini.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapmini.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapmini.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
deneyapmini.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapmini.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

deneyapmini.menu.CPUFreq.240=240MHz (WiFi)
deneyapmini.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapmini.menu.CPUFreq.160=160MHz (WiFi)
deneyapmini.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapmini.menu.CPUFreq.80=80MHz (WiFi)
deneyapmini.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapmini.menu.CPUFreq.40=40MHz
deneyapmini.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapmini.menu.CPUFreq.20=20MHz
deneyapmini.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapmini.menu.CPUFreq.10=10MHz
deneyapmini.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapmini.menu.FlashMode.qio=QIO
deneyapmini.menu.FlashMode.qio.build.flash_mode=dio
deneyapmini.menu.FlashMode.qio.build.boot=qio
deneyapmini.menu.FlashMode.dio=DIO
deneyapmini.menu.FlashMode.dio.build.flash_mode=dio
deneyapmini.menu.FlashMode.dio.build.boot=dio
deneyapmini.menu.FlashMode.qout=QOUT
deneyapmini.menu.FlashMode.qout.build.flash_mode=dout
deneyapmini.menu.FlashMode.qout.build.boot=qout
deneyapmini.menu.FlashMode.dout=DOUT
deneyapmini.menu.FlashMode.dout.build.flash_mode=dout
deneyapmini.menu.FlashMode.dout.build.boot=dout

